## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64340904/runs/9ce14641-b0e7-4b8f-b08a-00709925f956).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.atlas_schema.terrateam will be read during apply
  # (config refers to values not yet known)
 <= data "atlas_schema" "terrateam" {
+       dev_url = (sensitive value)
+       hcl     = (known after apply)
+       id      = (known after apply)
+       src     = <<-EOT
            table "users" {
              schema = schema.public
              column "id" {
                type = uuid
                default = sql("gen_random_uuid()")
              }
              column "name" {
                type = text
                null = false
              }
              column "isadmin" {
                type = boolean
                null = false
              }
              primary_key {
                columns = [column.id]
              }
            }
            schema "public" {
            }
        EOT
    }

  # atlas_schema.terrateam will be created
+   resource "atlas_schema" "terrateam" {
+       hcl = (known after apply)
+       id  = (known after apply)
+       url = (sensitive value)
    }

  # aws_db_instance.terrateam will be created
+   resource "aws_db_instance" "terrateam" {
+       address                               = (known after apply)
+       allocated_storage                     = 5
+       apply_immediately                     = false
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = (known after apply)
+       backup_target                         = (known after apply)
+       backup_window                         = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       database_insights_mode                = (known after apply)
+       db_name                               = (known after apply)
+       db_subnet_group_name                  = "terrateam"
+       dedicated_log_volume                  = false
+       delete_automated_backups              = true
+       domain_fqdn                           = (known after apply)
+       endpoint                              = (known after apply)
+       engine                                = "postgres"
+       engine_lifecycle_support              = (known after apply)
+       engine_version                        = "17.2"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = "terrateam"
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t3.micro"
+       iops                                  = (known after apply)
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
+       license_model                         = (known after apply)
+       listener_endpoint                     = (known after apply)
+       maintenance_window                    = (known after apply)
+       master_user_secret                    = (known after apply)
+       master_user_secret_kms_key_id         = (known after apply)
+       monitoring_interval                   = 0
+       monitoring_role_arn                   = (known after apply)
+       multi_az                              = (known after apply)
+       nchar_character_set_name              = (known after apply)
+       network_type                          = (known after apply)
+       option_group_name                     = (known after apply)
+       parameter_group_name                  = (known after apply)
+       password                              = (sensitive value)
+       password_wo                           = (write-only attribute)
+       performance_insights_enabled          = false
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       publicly_accessible                   = true
+       replica_mode                          = (known after apply)
+       replicas                              = (known after apply)
+       resource_id                           = (known after apply)
+       skip_final_snapshot                   = true
+       snapshot_identifier                   = (known after apply)
+       status                                = (known after apply)
+       storage_throughput                    = (known after apply)
+       storage_type                          = "gp2"
+       tags_all                              = (known after apply)
+       timezone                              = (known after apply)
+       username                              = (sensitive value)
+       vpc_security_group_ids                = [
+           "sg-091f358403d80e0ae",
        ]
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

## Cost Estimation
**Total Monthly Difference: -0.64 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 15.87 | 15.23 | -0.64|
| | **Total** | **15.87** | **15.23** | **-0.64** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
